In [1]:
import os
import json
import psycopg2
from psycopg2.extras import DictCursor

POSTGRESQL_HOST = '10.129.0.25'

%load_ext sql

USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

%sql $CONNECT_DATA

In [2]:
%%sql postgresql:///jovyan
CREATE TABLE Employees (
    Employee_ID INT PRIMARY KEY,
    First_name varchar(200),
    Last_name varchar(200),
    Hire_date date,
    Job_ID varchar(200),
    Manager_ID INT,
    Department_ID INT
);
CREATE TABLE Departments (
    Department_ID INT PRIMARY KEY,
    Department_name varchar(200),
    Manager_ID INT
);
INSERT INTO Employees VALUES 
    (100, 'Steven', 'King', '1987-06-17', 'AD_PRES', 0, 90),
    (101, 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', 100, 90),
    (102, 'Lexa', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
    (103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
    (107, 'Diana', 'Lorentz', '1987-06-24', 'IT_PROG', 103, 60),
    (108, 'Nancy', 'Greenberg', '1987-06-25', 'FI_MGR', 101, 100),
    (109, 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
    (114, 'Den', 'Raphaely', '1987-07-01', 'PU_MAN', 100, 30),
    (118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 50),
    (144, 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', 114, 30),
    (145, 'John', 'Russell', '1987-08-01', 'SA_MAN', 100, 80),
    (146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80);
    
INSERT INTO Departments VALUES
    (10, 'Administration', 200),
    (30, 'Purchasing', 114),
    (40, 'HumanResources', 203),
    (50, 'Shipping', 121),
    (60, 'IT', 103),
    (70, 'PublicRelations', 204),
    (80, 'Sales', 145),
    (90, 'Executive', 100),
    (100, 'Finance', 108),
    (110, 'Accounting', 205);

Done.
Done.
12 rows affected.
10 rows affected.

[]

In [10]:
%%sql
SELECT d.Department_name, e.First_name || ' ' || e.Last_name AS Manager_name, COUNT(em.Employee_ID) AS Number_of_Employees
FROM Departments d
JOIN Employees e ON d.Manager_ID = e.Employee_ID
LEFT JOIN Employees em ON d.Department_ID = em.Department_ID
GROUP BY d.Department_name, e.First_name, e.Last_name
ORDER BY d.Department_name;

 * postgresql:///jovyan
   postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Executive', 'Steven King', 3),
 ('Finance', 'Nancy Greenberg', 2),
 ('IT', 'Alexander Hunold', 2),
 ('Purchasing', 'Den Raphaely', 2),
 ('Sales', 'John Russell', 2)]